---
kind: method
id: M:Autodesk.Revit.DB.CurveArrArray.#ctor
source: html/9ff21286-3e0e-5f19-1b72-d2ebf5c296d1.htm
---
# Autodesk.Revit.DB.CurveArrArray.#ctor Method

Initializes a new instance of the CurveArrArray class

## Syntax (C#)
```csharp
public CurveArrArray()
```